---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionHandler
source: html/78653026-36f1-6ab3-f2c0-728692c99b3c.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler

An object of Structural Connection Handler.

## Syntax (C#)
```csharp
public class StructuralConnectionHandler : Element
```